#1 tree traversal
'''
pre in post x-traversal
'''

#2 binary search tree
'''
ให้ตัวเลขมาจำนวนหนึ่ง
ให้เขียน binary search tree ถ้าเรียกใช้ function add ทีละตัวจากซ้ายไปขวา
(เริ่มจากต้นไม้เปล่า ๆ)
'''

#3
'''
ให้ graph มาหนึ่งอัน
หากต้องการเดินทางจาก node A ไป node F
ให้เขียนลำดับการค้นหาจนกว่าจะเจอเป้าหมายหาก

1. ใช้ depth-first search
2. ใช้ breadth-forst search

*(ให้เขียนทุก node ที่เจอตามลำดับไม่ใช่แค่ node ในเส้นทางที่เจอ)
**(ค่าใน node จะเป็น ตัวอักษร ในการค้นหาทั้งสองวิธี 
หากต้องเลือกค้นหาทางใดทางหนึ่งก่อน จะเลือกหาอักษรที่มาก่อน)
'''

#4
'''
ให้ heap มาหนึ่งอัน(implement โดยใช้ list)
ให้เขียน
1. ขั้นตอนการเปลี่ยนแปลงไปของ heap หากใช้ heappop(heap)
2. ขั้นตอนการเปลี่ยนแปลงไปของ heap หากใช้ heappush(heap, 5)
'''

#ข้อย่อยยาว ๆ เยอะ ๆ

#5
'''
combination lock
'''

#6
'''
(เพกาซัส)
หาโครงข่ายนักชุมนุม
'''